[
    {
        "title": "Bug bounty programs for cybersecurity: Practices, issues, and recommendations",
        "year": 2019,
        "notes":[
            "<b>We<b/> analyze and recommend best practices in five main BBP areas", 
            "<br/><b>scoping of BBPs</b>",
            "<br/><b>timing of crowd engagement</b>",
            "<br/><b>submission quality</b>",
            "<br/><b>firm-researcher communication</b>",
            "<br/><b>hacker motivation</b>."
        ],
        "topics":["bbp"]
    },
    {
        "title": "An empirical study of bug bounty programs",
        "year": 2020,
        "notes":[
            "<br><b>We</b> find that the average cost of operating a bug bounty program for a year is now less than the cost of hiring two additional software engineers",
            "<br><b>HackerOne and BugCrowd</b>"
        ],
        "topics":["bbp"]
    },
    {
        "title": "Given enough eyeballs, all bugs are shallow? Revisiting Eric Raymond with bug bounty programs",
        "year": 2017,
        "notes":[
            "Empirical investigation of the strategic interactions among the managers and participants of bug bounty programs",
            "<br/>Each security researcher inspecting a piece of software offers a unique environment of skills and mindset, which is amenable to the discovery of bugs that others may not be able to uncover.",
            "<br/>Conversely, security researchers benefit greatly from searching for bugs in multiple bug bounty programs"
        ],
        "topics":["bbp"]
    },
    {
        "title": "Bug {Hunters'} Perspectives on the Challenges and Benefits of the Bug Bounty Ecosystem",
        "year": 2023,
        "notes":[],
        "topics":["hunter"]
    },
    {
        "title": " A Survey of Bug Bounty Programs in Strengthening Cybersecurity and Privacy in the Blockchain Industry",
        "year": 2024,
        "notes":[
            "This paper provides a comprehensive survey of various free and paid bug bounty programs in the computer networks and blockchain industry, evaluating their effectiveness, impact, and credibility.",
            "<br/>The study explores the structure, incentives, and nature of vulnerabilities uncovered by these programs, as well as their unique value proposition.",
            "<br/>A comparative analysis is conducted to identify advantages and disadvantages, highlighting the strengths and weaknesses of each program.",
            "<br/>The paper also examines the role of ethical hackers in bug bounty programs and their contributions to strengthening cybersecurity and privacy.", 
            "<br/>Finally, the study concludes with recommendations for addressing the challenges faced by bug bounty programs and suggests potential future directions to enhance their impact on computer networks and blockchain security."
        ],
        "topics":["bbp"]
    }
]